# YOLOv8m-CBAM Optimized (Hanya di P3)
nc: 7
scales:
  m: [0.67, 0.75, 768]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [512]] # 12 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14
  - [-1, 3, C2f, [256]] # 15 (P3/Small Object)
  - [-1, 1, CBAM, []] # 16 <--- CBAM P3

  - [-1, 1, Conv, [256, 3, 2]] # 17 
  - [[-1, 12], 1, Concat, [1]] # 18
  - [-1, 3, C2f, [512]] # 19 (P4/Medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20 
  - [[-1, 9], 1, Concat, [1]] # 21
  - [-1, 3, C2f, [1024]] # 22 (P5/Large)

  - [[16, 19, 22], 1, Detect, [nc]] # 23 
